20240803T214146--kdoc-211-リアルな都市形成シミュレーションゲームに必要な要素を考える__essay.org
:properties:
:ID: 20240803T214146
:mtime:    20250626233433
:ctime:    20241028101410
:end:
#+title:      KDOC 211: リアルな都市形成シミュレーションゲームに必要な要素を考える
#+date:       [2024-08-03 Sat 21:41]
#+filetags:   :essay:
#+identifier: 20240803T214146

* この文書のステータス
- 作成
  - [X] 2024-08-10 貴島
- レビュー
  - [X] 2024-08-11 貴島

* 概要

東京の街並みは、どこも違って興味深く見える。その形成過程をゲームでシミュレーションできれば楽しそうに見えるが、まだそんなゲームはないようだ。

ビデオゲームの[[https://store.steampowered.com/app/255710/Cities_Skylines/][Cities: Skylines]]とか[[id:7c01d791-1479-4727-b076-280034ab6a40][Simutrans]]をプレイしていると、退屈な碁盤の目状の街になってしまう。YouTubeに投稿されているようなゲーム動画には現実の都市らしく感じられるものがあり、本人の技量(妄想力)次第なところがある。

現実世界で奥深い町並みを形成する制約をゲームシステムに組み込めれば、誰でも興味深い街の形成を眺めることができるだろう。そんなシミュレーションゲームをやりたい。

ということで、リアルな都市形成シミュレーションゲームに必要な要素を列挙する。

- 支配者層の変化
  - 貴族
  - 武士
  - 国家主義
  - 全体主義
  - 資本主義
- 関係団体
  - 政治拠点
  - 国鉄
  - 私鉄の沿線開発
  - 国鉄 vs 私鉄
  - 再開発
- 地価
- 産業構造
  - 小売
  - 製造
  - サービス
- 建築規制
  - 建ぺい率
  - 斜線規制
  - 規制緩和
- 時代による技術の進化
  - 交通
  - 軍事
  - 建築
- 水流
  - 水流が刻む起伏
  - 海水面の変動
  - 治水工事
- 災害および戦災
  - 水害
  - 火事
  - 地震
- 住環境の指向性
  - 山の手 vs 下町
  - 湿度
  - 日当たり
  - 地盤の強さ

* 関連
なし。
