20240803T214146--kdoc-211-リアルな都市形成シミュレーションゲームに必要な要素を考える__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:33:27Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 211: リアルな都市形成シミュレーションゲームに必要な要素を考える</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 211: リアルな都市形成シミュレーションゲームに必要な要素を考える</h1>
<div id="outline-container-orgedac775" class="outline-2">
<h2 id="orgedac775"><a href="#orgedac775">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgedac775">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-08-10 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-08-11 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org409b97e" class="outline-2">
<h2 id="org409b97e"><a href="#org409b97e">概要</a></h2>
<div class="outline-text-2" id="text-org409b97e">
<p>
東京の街並みは、どこも違って興味深く見える。その形成過程をゲームでシミュレーションできれば楽しそうに見えるが、まだそんなゲームはないようだ。
</p>

<p>
ビデオゲームの<a href="https://store.steampowered.com/app/255710/Cities_Skylines/">Cities: Skylines</a>とか<a href="20211107110444-simutrans.html#ID-7c01d791-1479-4727-b076-280034ab6a40">Simutrans</a>をプレイしていると、退屈な碁盤の目状の街になってしまう。YouTubeに投稿されているようなゲーム動画には現実の都市らしく感じられるものがあり、本人の技量(妄想力)次第なところがある。
</p>

<p>
現実世界で奥深い町並みを形成する制約をゲームシステムに組み込めれば、誰でも興味深い街の形成を眺めることができるだろう。そんなシミュレーションゲームをやりたい。
</p>

<p>
ということで、リアルな都市形成シミュレーションゲームに必要な要素を列挙する。
</p>

<ul class="org-ul">
<li>支配者層の変化
<ul class="org-ul">
<li>貴族</li>
<li>武士</li>
<li>国家主義</li>
<li>全体主義</li>
<li>資本主義</li>
</ul></li>
<li>関係団体
<ul class="org-ul">
<li>政治拠点</li>
<li>国鉄</li>
<li>私鉄の沿線開発</li>
<li>国鉄 vs 私鉄</li>
<li>再開発</li>
</ul></li>
<li>地価</li>
<li>産業構造
<ul class="org-ul">
<li>小売</li>
<li>製造</li>
<li>サービス</li>
</ul></li>
<li>建築規制
<ul class="org-ul">
<li>建ぺい率</li>
<li>斜線規制</li>
<li>規制緩和</li>
</ul></li>
<li>時代による技術の進化
<ul class="org-ul">
<li>交通</li>
<li>軍事</li>
<li>建築</li>
</ul></li>
<li>水流
<ul class="org-ul">
<li>水流が刻む起伏</li>
<li>海水面の変動</li>
<li>治水工事</li>
</ul></li>
<li>災害および戦災
<ul class="org-ul">
<li>水害</li>
<li>火事</li>
<li>地震</li>
</ul></li>
<li>住環境の指向性
<ul class="org-ul">
<li>山の手 vs 下町</li>
<li>湿度</li>
<li>日当たり</li>
<li>地盤の強さ</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5f7ed15" class="outline-2">
<h2 id="org5f7ed15"><a href="#org5f7ed15">関連</a></h2>
<div class="outline-text-2" id="text-org5f7ed15">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
